---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ModelPathUtils Methods
ModelPathUtils Class See Also Send Feedback
---

The ModelPathUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | ConvertCloudGUIDsToCloudPath | Converts a pair of cloud project and model GUIDs to a valid cloud path. |
|  | ConvertModelPathToUserVisiblePath | Gets a string version of the path of a given ModelPath. |
|  | ConvertUserVisiblePathToModelPath | Converts a user-visible path (string) to a ModelPath. |
|  | IsValidUserVisibleFullServerPath | Determines whether the given string represents a valid server path. |

# See Also

ModelPathUtils Class

Autodesk.Revit.DB Namespace